In [1]:
import glob
import pandas as pd
import numpy as np

In [2]:
# read user files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/usagers*.csv"):
    files.append(file)

# import user files
users = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',')
    if i == 0:
        users = file
    else:
        users = pd.concat([users, file], axis = 0)

# export csv
users.to_csv("./data/users.csv", sep = ',', header = True, na_rep = 'n/a', index=False)
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2509620 entries, 0 to 129152
Data columns (total 16 columns):
 #   Column       Dtype
---  ------       -----
 0   Num_Acc      int64
 1   place        float64
 2   catu         int64
 3   grav         int64
 4   sexe         int64
 5   trajet       float64
 6   secu         float64
 7   locp         float64
 8   actp         object
 9   etatp        float64
 10  an_nais      float64
 11  num_veh      object
 12  id_vehicule  object
 13  secu1        float64
 14  secu2        float64
 15  secu3        float64
dtypes: float64(9), int64(4), object(3)
memory usage: 325.5+ MB

In [3]:
users.head()

,Num_Acc,place,catu,grav,sexe,trajet,secu,locp,actp,etatp,an_nais,num_veh,id_vehicule,secu1,secu2,secu3
0,200500000001,1.0,1,4,1,1.0,11.0,0.0,0.0,0.0,1976.0,A01,NaN,NaN,NaN,NaN
1,200500000001,1.0,1,3,2,3.0,11.0,0.0,0.0,0.0,1968.0,B02,NaN,NaN,NaN,NaN
2,200500000001,2.0,2,1,1,0.0,11.0,0.0,0.0,0.0,1964.0,B02,NaN,NaN,NaN,NaN
3,200500000001,4.0,2,1,1,0.0,31.0,0.0,0.0,0.0,2004.0,B02,NaN,NaN,NaN,NaN
4,200500000001,5.0,2,1,1,0.0,11.0,0.0,0.0,0.0,1998.0,B02,NaN,NaN,NaN,NaN

In [4]:
# read characteristics (=features) files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/caracter*.csv"):
    files.append(file)

# import user files
features = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',', encoding='latin-1', na_values=['N/A', 'n/a',''])
    if i == 0:
        features = file
    else:
        features = pd.concat([features, file], axis = 0)

# export csv
features.to_csv("./data/features.csv", sep = ',', header = True, na_rep = 'n/a', index=False)
features.info()

<class 'pandas.core.frame.DataFrame'>
Index: 982060 entries, 0 to 47743
Data columns (total 16 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   Num_Acc  982060 non-null  int64
 1   an       982060 non-null  int64
 2   mois     982060 non-null  int64
 3   jour     982060 non-null  int64
 4   hrmn     982060 non-null  object
 5   lum      982060 non-null  int64
 6   agg      982060 non-null  int64
 7   int      982060 non-null  int64
 8   atm      981987 non-null  float64
 9   col      982041 non-null  float64
 10  com      982058 non-null  object
 11  adr      850489 non-null  object
 12  gps      455722 non-null  object
 13  lat      553725 non-null  object
 14  long     553721 non-null  object
 15  dep      982060 non-null  object
dtypes: float64(2), int64(7), object(7)
memory usage: 127.4+ MB

In [5]:
# read places files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/lieux*.csv"):
    files.append(file)

# import user files
places = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',', encoding='latin-1', na_values=['N/A', 'n/a',''], low_memory=False)
    if i == 0:
        places = file
    else:
        places = pd.concat([features, file], axis = 0)

# export csv
places.to_csv("./data/places.csv", sep = ',', header = True, na_rep = 'N/A', index=False)
places.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1038578 entries, 0 to 56517
Data columns (total 33 columns):
 #   Column   Non-Null Count    Dtype
---  ------   --------------    -----
 0   Num_Acc  1038578 non-null  int64
 1   an       982060 non-null   float64
 2   mois     982060 non-null   float64
 3   jour     982060 non-null   float64
 4   hrmn     982060 non-null   object
 5   lum      982060 non-null   float64
 6   agg      982060 non-null   float64
 7   int      982060 non-null   float64
 8   atm      981987 non-null   float64
 9   col      982041 non-null   float64
 10  com      982058 non-null   object
 11  adr      850489 non-null   object
 12  gps      455722 non-null   object
 13  lat      553725 non-null   object
 14  long     553721 non-null   object
 15  dep      982060 non-null   object
 16  catr     56518 non-null    float64
 17  voie     52111 non-null    object
 18  v1       56518 non-null    float64
 19  v2       4990 non-null     object
 20  circ     56518 non-null    float64
 21  nbv      56518 non-null    float64
 22  vosp     56518 non-null    float64
 23  prof     56518 non-null    float64
 24  pr       56518 non-null    object
 25  pr1      56518 non-null    object
 26  plan     56518 non-null    float64
 27  lartpc   108 non-null      object
 28  larrout  56518 non-null    object
 29  surf     56518 non-null    float64
 30  infra    56518 non-null    float64
 31  situ     56518 non-null    float64
 32  vma      56518 non-null    float64
dtypes: float64(19), int64(1), object(13)
memory usage: 269.4+ MB

In [168]:
# read vehicle files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/vehicules*.csv"):
    files.append(file)

# import user files
vehicles = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',', encoding='utf-8', na_values=['N/A', 'n/a',''], low_memory=False)
    if i == 0:
        vehicles = file
    else:
        vehicles = pd.concat([vehicles, file], axis = 0)

# export csv
vehicles.to_csv("./data/vehicles.csv", sep = ',', header = True, na_rep = 'N/A', index=False)
vehicles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1914902 entries, 0 to 97314
Data columns (total 11 columns):
 #   Column       Dtype
---  ------       -----
 0   Num_Acc      int64
 1   senc         float64
 2   catv         int64
 3   occutc       float64
 4   obs          float64
 5   obsm         float64
 6   choc         float64
 7   manv         float64
 8   num_veh      object
 9   id_vehicule  object
 10  motor        float64
dtypes: float64(7), int64(2), object(2)
memory usage: 175.3+ MB

In [169]:
vehicles.head()

,Num_Acc,senc,catv,occutc,obs,obsm,choc,manv,num_veh,id_vehicule,motor
0,200500000001,0.0,7,0.0,0.0,2.0,1.0,1.0,A01,NaN,NaN
1,200500000001,0.0,7,0.0,0.0,2.0,8.0,10.0,B02,NaN,NaN
2,200500000002,0.0,7,0.0,0.0,2.0,7.0,16.0,A01,NaN,NaN
3,200500000002,0.0,2,0.0,0.0,2.0,1.0,1.0,B02,NaN,NaN
4,200500000003,0.0,2,0.0,0.0,2.0,1.0,1.0,A01,NaN,NaN

In [8]:
# read registered vehicle files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/registered_vehicles*.csv"):
    files.append(file)

# import user files
registered_vehicles = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ';', na_values=['N/A', 'n/a',''], low_memory=False, encoding="UTF-8")
    if i == 0:
        registered_vehicles = file
    else:
        registered_vehicles = pd.concat([registered_vehicles, file], axis = 0)

registered_vehicles.head()

,Id_accident,Lettre Conventionnelle Véhicule,Année,Lieu Admin Actuel - Territoire Nom,Type Accident - Libellé (old),CNIT,Catégorie véhicule,Age véhicule,Type Accident - Libellé
0,63 933 550,A,2009,DOM,Accident grave non mortel,NaN,Cyclo,NaN,NaN
1,63 933 550,B,2009,DOM,Accident grave non mortel,NaN,VT,19,NaN
2,63 933 551,A,2009,DOM,Accident mortel,MPL51F1FP136,VT,0,NaN
3,63 933 552,A,2009,DOM,Accident Léger,NaN,Moto lourde,4,NaN
4,63 933 552,B,2009,DOM,Accident Léger,NaN,VT,2,NaN

In [9]:
registered_vehicles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1200791 entries, 0 to 74663
Data columns (total 9 columns):
 #   Column                              Non-Null Count    Dtype
---  ------                              --------------    -----
 0   Id_accident                         1200791 non-null  object
 1   Lettre Conventionnelle Véhicule     1200790 non-null  object
 2   Année                               1200791 non-null  int64
 3   Lieu Admin Actuel - Territoire Nom  1200791 non-null  object
 4   Type Accident - Libellé (old)       122598 non-null   object
 5   CNIT                                776011 non-null   object
 6   Catégorie véhicule                  1200791 non-null  object
 7   Age véhicule                        1096605 non-null  object
 8   Type Accident - Libellé             1078193 non-null  object
dtypes: int64(1), object(8)
memory usage: 91.6+ MB

In [10]:
# data wrangling
# Id_accident contains whitespace, needs to be removed

registered_vehicles['Id_accident'] = registered_vehicles['Id_accident'].replace(" ", "")

In [11]:
registered_vehicles['Id_accident']

0        63 933 550
1        63 933 550
2        63 933 551
3        63 933 552
4        63 933 552
            ...
74659    66 554 980
74660    66 554 980
74661    66 554 981
74662    66 554 982
74663    66 554 982
Name: Id_accident, Length: 1200791, dtype: object

In [12]:
# The whitespace is not removed. Very strange.
# Let's check the string:
registered_vehicles.iloc[0].Id_accident

'63\xa0933\xa0550'

In [13]:
registered_vehicles.iloc[74659].Id_accident

'63\xa0979\xa0135'

In [14]:
# well, this is unbreakable space...
# strange encoding..
# found this https://stackoverflow.com/questions/10993612/how-to-remove-xa0-from-string-in-python

In [15]:
new_id = list()
for i in range(0, len(registered_vehicles)):
    new_id.append(registered_vehicles.iloc[i].Id_accident.replace('\xa0', ''))

In [16]:
# Replace
registered_vehicles.Id_accident = new_id

# new_id is still string, so let's change:
registered_vehicles = registered_vehicles.astype({"Id_accident":"int"})

In [17]:
vehicles.head()

,Num_Acc,senc,catv,occutc,obs,obsm,choc,manv,num_veh,id_vehicule,motor
0,200500000001,0.0,7,0.0,0.0,2.0,1.0,1.0,A01,NaN,NaN
1,200500000001,0.0,7,0.0,0.0,2.0,8.0,10.0,B02,NaN,NaN
2,200500000002,0.0,7,0.0,0.0,2.0,7.0,16.0,A01,NaN,NaN
3,200500000002,0.0,2,0.0,0.0,2.0,1.0,1.0,B02,NaN,NaN
4,200500000003,0.0,2,0.0,0.0,2.0,1.0,1.0,A01,NaN,NaN

In [18]:
registered_vehicles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1200791 entries, 0 to 74663
Data columns (total 9 columns):
 #   Column                              Non-Null Count    Dtype
---  ------                              --------------    -----
 0   Id_accident                         1200791 non-null  int32
 1   Lettre Conventionnelle Véhicule     1200790 non-null  object
 2   Année                               1200791 non-null  int64
 3   Lieu Admin Actuel - Territoire Nom  1200791 non-null  object
 4   Type Accident - Libellé (old)       122598 non-null   object
 5   CNIT                                776011 non-null   object
 6   Catégorie véhicule                  1200791 non-null  object
 7   Age véhicule                        1096605 non-null  object
 8   Type Accident - Libellé             1078193 non-null  object
dtypes: int32(1), int64(1), object(7)
memory usage: 87.0+ MB

In [19]:
# export csv
registered_vehicles.to_csv("./data/registered_vehicles.csv", sep = ',', header = True, na_rep = 'N/A', index=False)

## Update 11 June 2023
I realised that users has a similar field, I just convert this additionally1

In [20]:
users.iloc[0].id_vehicule

nan

In [21]:
users.head()

,Num_Acc,place,catu,grav,sexe,trajet,secu,locp,actp,etatp,an_nais,num_veh,id_vehicule,secu1,secu2,secu3
0,200500000001,1.0,1,4,1,1.0,11.0,0.0,0.0,0.0,1976.0,A01,NaN,NaN,NaN,NaN
1,200500000001,1.0,1,3,2,3.0,11.0,0.0,0.0,0.0,1968.0,B02,NaN,NaN,NaN,NaN
2,200500000001,2.0,2,1,1,0.0,11.0,0.0,0.0,0.0,1964.0,B02,NaN,NaN,NaN,NaN
3,200500000001,4.0,2,1,1,0.0,31.0,0.0,0.0,0.0,2004.0,B02,NaN,NaN,NaN,NaN
4,200500000001,5.0,2,1,1,0.0,11.0,0.0,0.0,0.0,1998.0,B02,NaN,NaN,NaN,NaN

So, same procedure as above:

In [22]:
# In the column exist nas, so a little different processing
new_id_users = list()
for i in range(0, len(users)):
    if type(users.iloc[i].id_vehicule) == str:
        new_id_users.append(users.iloc[i].id_vehicule.replace('\xa0', ''))
    elif np.isnan(users.iloc[i].id_vehicule) == True:
        new_id_users.append(pd.NA)

In [23]:
# Replace
users.id_vehicule = new_id_users

# new_id is still string, so let's change:
users.id_vehicule = users['id_vehicule'].astype('Int64')
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2509620 entries, 0 to 129152
Data columns (total 16 columns):
 #   Column       Dtype
---  ------       -----
 0   Num_Acc      int64
 1   place        float64
 2   catu         int64
 3   grav         int64
 4   sexe         int64
 5   trajet       float64
 6   secu         float64
 7   locp         float64
 8   actp         object
 9   etatp        float64
 10  an_nais      float64
 11  num_veh      object
 12  id_vehicule  Int64
 13  secu1        float64
 14  secu2        float64
 15  secu3        float64
dtypes: Int64(1), float64(9), int64(4), object(2)
memory usage: 327.9+ MB

In [24]:
# export csv
users.to_csv("./data/users.csv", sep = ',', header = True, na_rep = 'n/a', index=False)

And we have the same strange column in `vehicles`:vehicles.id_vehicule.unique()

In [180]:
print(vehicles.id_vehicule.unique())

[nan '138\xa0306\xa0524' '138\xa0306\xa0525' ... '100\xa0884' '100\xa0882'
 '100\xa0883']

In [181]:
vehicles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1914902 entries, 0 to 97314
Data columns (total 11 columns):
 #   Column       Dtype
---  ------       -----
 0   Num_Acc      int64
 1   senc         float64
 2   catv         int64
 3   occutc       float64
 4   obs          float64
 5   obsm         float64
 6   choc         float64
 7   manv         float64
 8   num_veh      object
 9   id_vehicule  object
 10  motor        float64
dtypes: float64(7), int64(2), object(2)
memory usage: 175.3+ MB

In [190]:
vehicles_select = vehicles[['Num_Acc', 'id_vehicule']].sort_values(by = 'Num_Acc', ascending = True)
vehicles_select.head()

        Num_Acc id_vehicule
0  200500000001         NaN
1  200500000001         NaN
2  200500000002         NaN
3  200500000002         NaN
4  200500000003         NaN

In [191]:
vehicles_select.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1914902 entries, 0 to 97314
Data columns (total 2 columns):
 #   Column       Dtype
---  ------       -----
 0   Num_Acc      int64
 1   id_vehicule  object
dtypes: int64(1), object(1)
memory usage: 43.8+ MB

In [ ]:
new_id_vehicles = pd.DataFrame(columns=['Num_Acc', 'id_vehicule'])
new_id_vehicles.info()

In [ ]:
for i in range(0, len(vehicles_select)):
    if type(vehicles_select.iloc[i].id_vehicule) == float:
        new_id_vehicles = new_id_vehicles._append(pd.DataFrame([{'Num_Acc': vehicles_select.iloc[i].Num_Acc, 'id_vehicule':pd.NA}]))
    elif type(vehicles_select.iloc[i].id_vehicule) == str:
        new_id_vehicles = new_id_vehicles._append(pd.DataFrame([{'Num_Acc': vehicles_select.iloc[i].Num_Acc, 'id_vehicule':vehicles_select.iloc[i].id_vehicule.replace('\xa0', '')}]))
        #new_id_vehicles = new_id_vehicles._append(pd.DataFrame([{'Num_Acc': vehicles_select.iloc[i].Num_Acc, 'id_vehicule':vehicles.iloc[i].id_vehicule.replace('Â\xa0', '')}]))
        #value = vehicles.iloc[i].id_vehicule.replace('Â\xa0', '')
    else:
        print(i)
        print(type(vehicles_select.iloc[i].id_vehicule))
new_id_vehicles.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Num_Acc      0 non-null      object
 1   id_vehicule  0 non-null      object
dtypes: object(2)
memory usage: 132.0+ bytes

In [138]:
new_id_vehicles

         Num_Acc id_vehicule
0   200500000001         NaN
0   200500000001         NaN
0   200500000002         NaN
0   200500000002         NaN
0   200500000003         NaN
..           ...         ...
0   200500005385         NaN
0   200500005386         NaN
0   200500005386         NaN
0   200500005387         NaN
0   200500005387         NaN

[9157 rows x 2 columns]

# new_id is still string, so let's change:
vehicles = vehicles.astype({"id_vehicule":"int"})

vehicles.to_csv("./data/vehicles.csv", sep = ',', header = True, na_rep = 'N/A', index=False)